In [1]:
word = 'Layla'

In [2]:
sent = 'Layla is cute'

In [3]:
word[0]

'L'

In [4]:
sent[0]

'L'

In [6]:
sent[0:5]

'Layla'

In [7]:
sent[ : ]

'Layla is cute'

In [8]:
sent[:len(word)]

'Layla'

In [9]:
text = 'The Layla is cute, because she was cute'

In [10]:
text

'The Layla is cute, because she was cute'

In [11]:
text[:len(text)]

'The Layla is cute, because she was cute'

In [12]:
sent[-7:-3]

'is c'

In [13]:
'{0:4.6} output'.format(7/67890)

'0.000103108 output'

In [15]:
sent[-3:]

'ute'

In [16]:
sent

'Layla is cute'

In [17]:
word[:3]

'Lay'

In [18]:
word[0:3]

'Lay'

In [19]:
sent[4:]

'a is cute'

In [20]:
sent[:]

'Layla is cute'

In [21]:
sent[::2]

'Lyai ue'

In [22]:
a = 'Name : Layla'
b = 'StudentID : 20231111'
c = 'Hobby : Study'
d = 'Comment : cute'

In [24]:
" ".join([a, b, c, d])

'Name : Layla StudentID : 20231111 Hobby : Study Comment : cute'

In [25]:
strs = """Guard: What? Ridden en a horse?
Queen Raiden: Yes!
Guard: You're using coconuts!
Queen Raiden: What?
Guard: You're Got ... coconute[s] and you're banagin em togther
"""

In [27]:
strs

"Guard: What? Ridden en a horse?\nQueen Raiden: Yes!\nGuard: You're using coconuts!\nQueen Raiden: What?\nGuard: You're Got ... coconute[s] and you're banagin em togther\n"

In [28]:
strs.splitlines()[::2]

['Guard: What? Ridden en a horse?',
 "Guard: You're using coconuts!",
 "Guard: You're Got ... coconute[s] and you're banagin em togther"]

In [29]:
strs.replace('Guard', "Yae Miko").splitlines()[::2]

['Yae Miko: What? Ridden en a horse?',
 "Yae Miko: You're using coconuts!",
 "Yae Miko: You're Got ... coconute[s] and you're banagin em togther"]

In [30]:
'{} is very cute!'.format('Layla')

'Layla is very cute!'

In [31]:
"""{0}은 매우매우 착하고 귀엽고 사랑스럽습니다.
이 사악한 {1}은 {0}을 괴롭히는 원인 중 하나입니다.
""".format("레일라","나히다")

'레일라은 매우매우 착하고 귀엽고 사랑스럽습니다.\n이 사악한 나히다은 레일라을 괴롭히는 원인 중 하나입니다.\n'

In [32]:
'나히다는 {age} 살 이상이다.'.format(age = 500)

'나히다는 500 살 이상이다.'

In [33]:
'나의 통장 잔고가 {:,}달러면 좋겠다'.format(909999999999999999999999999999999999)

'나의 통장 잔고가 909,999,999,999,999,999,999,999,999,999,999,999달러면 좋겠다'

In [34]:
'output1 : {0:.3}\n output2 : {0:.3%}'.format(7/67890)

'output1 : 0.000103\n output2 : 0.010%'

In [35]:
'My id code is {0:06d}'.format(12)

'My id code is 000012'

In [36]:
'My love number is %d' % 10

'My love number is 10'

In [38]:
'%(name)s 는 매우 매우 귀엽고 사랑스럽지만, 그녀의 수면 시간은 고작 %(time).2f 시간 이다.' % ({'name' : 'Layla', 'time' : 1.1631212})

'Layla 는 매우 매우 귀엽고 사랑스럽지만, 그녀의 수면 시간은 고작 1.16 시간 이다.'

In [40]:
name = "레일라"
f'{name}! 12/19 생일 축하해!'

'레일라! 12/19 생일 축하해!'

In [41]:
import datetime

In [42]:
print(f"t1 : {datetime.datetime.now()}")
print(f"t2 : {datetime.datetime(1970, 1,1)}")
print(f"t3 : {datetime.datetime(1970, 12, 12, 13, 24, 34)}")

t1 : 2023-12-17 15:20:48.820107
t2 : 1970-01-01 00:00:00
t3 : 1970-12-12 13:24:34

In [43]:
import re

In [49]:
ax  = re.match(pattern='\d{10}', string = '1234567890')
ax

In [46]:
print("match" if bool(ax) else "Unmatch")

match

In [47]:
ax  = re.match(pattern='\d{10}\s', string = '1234567890')
ax

In [48]:
print("match" if bool(ax) else "Unmatch")

Unmatch

In [50]:
print("match" if bool(ax) else "Unmatch")

match

In [52]:
ax.start()
ax.end()
ax.span()

(0, 10)

In [53]:
ax.start()

0

In [54]:
ax.end()

10

In [55]:
ax.span()

(0, 10)

In [58]:
ax.group()

'1234567890'

In [59]:
re.match(pattern='\d{3}\s\d{4}\s\d{4}', string = '123 4567 8901')

In [60]:
re.match(pattern='\(\d{3}\)\s\d{3}\-\d{4}', string = '(123) 456-7890')

In [61]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string = '+1 (123) 456-7890')

In [63]:
p = re.compile('\D{9}\:\d{4}')
p.match('LocalHost:8888')

In [64]:
my_exp = lambda x : x ** 2
my_exp_c = lambda x, n : x ** n

In [65]:
import pandas as pd

In [66]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [67]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [68]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [69]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [70]:
df['a'] ** 10

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [71]:
df['a'].apply(my_exp_c, n = 10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [72]:
printme = lambda x : print(x)

In [73]:
printme

In [74]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [76]:
# 반전효과, 행(0), 열(1) 반전 행(1) 열(0)
df.apply(printme, axis = 1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [77]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [78]:
def mymean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [81]:
import numpy as np

In [79]:
df.apply(mymean)

a    20.0
b    30.0
dtype: float64

In [80]:
df.apply(mymean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [82]:
df.apply(np.mean)

a    20.0
b    30.0
dtype: float64

In [83]:
df.apply(np.mean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [84]:
import seaborn as sns

In [85]:
df = sns.load_dataset("titanic")

In [86]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [87]:
df['missing'] = df.apply(lambda x : pd.isnull(x).sum(), axis = 1)

In [88]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [89]:
getNAN = lambda x : pd.isnull(x).sum()

In [90]:
df.apply(getNAN)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
missing          0
dtype: int64

In [91]:
getnan = lambda x : (pd.isnull(x).sum() / x.size)

In [93]:
a = df.apply(getnan)

In [94]:
a

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
missing        0.000000
dtype: float64

In [95]:
getnan2 = lambda x : (pd.isnull(x).sum() / x.size) * 100

In [97]:
a = df.apply(getnan2)
a

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
missing         0.000000
dtype: float64

In [98]:
nonnan = lambda x : 1 - (pd.isnull(x).sum() / x.size)

In [99]:
df.apply(nonnan)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
missing        1.000000
dtype: float64

In [100]:
nonnan2 = lambda x : ( 1 - (pd.isnull(x).sum() / x.size)) * 100

In [105]:
b = df.apply(nonnan2)
b

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
missing        100.000000
dtype: float64

In [104]:
a

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
missing         0.000000
dtype: float64

In [106]:
b

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
missing        100.000000
dtype: float64

In [107]:
a + b

survived       100.0
pclass         100.0
sex            100.0
age            100.0
sibsp          100.0
parch          100.0
fare           100.0
embarked       100.0
class          100.0
who            100.0
adult_male     100.0
deck           100.0
embark_town    100.0
alive          100.0
alone          100.0
missing        100.0
dtype: float64